local make_map = require 'parse.char.utf8.make.map'

return require 'parse.char.utf8.map.to_upper.reversible' + {
	'ßSS';'ﬀFF';'ﬁFI';'ﬂFL';'ﬃFFI';'ﬄFFL';'ﬅST';'ﬆST';'ևԵՒ';'ﬓՄՆ';'ﬔՄԵ';'ﬕՄԻ';'ﬖՎՆ';'ﬗՄԽ';'ŉʼN';'ΐΪ́';
	'ΰΫ́';'ǰJ̌';'ẖH̱';'ẗT̈';'ẘW̊';'ẙY̊';'ẚAʾ';'ὐΥ̓';'ὒΥ̓̀';'ὔΥ̓́';'ὖΥ̓͂';'ᾶΑ͂';'ῆΗ͂';'ῒΪ̀';'ΐΪ́';'ῖΙ͂';
	'ῗΪ͂';'ῢΫ̀';'ΰΫ́';'ῤΡ̓';'ῦΥ͂';'ῧΫ͂';'ῶΩ͂';'ᾀἈΙ';'ᾁἉΙ';'ᾂἊΙ';'ᾃἋΙ';'ᾄἌΙ';'ᾅἍΙ';'ᾆἎΙ';'ᾇἏΙ';'ᾈἈΙ';
	'ᾉἉΙ';'ᾊἊΙ';'ᾋἋΙ';'ᾌἌΙ';'ᾍἍΙ';'ᾎἎΙ';'ᾏἏΙ';'ᾐἨΙ';'ᾑἩΙ';'ᾒἪΙ';'ᾓἫΙ';'ᾔἬΙ';'ᾕἭΙ';'ᾖἮΙ';'ᾗἯΙ';'ᾘἨΙ';
	'ᾙἩΙ';'ᾚἪΙ';'ᾛἫΙ';'ᾜἬΙ';'ᾝἭΙ';'ᾞἮΙ';'ᾟἯΙ';'ᾠὨΙ';'ᾡὩΙ';'ᾢὪΙ';'ᾣὫΙ';'ᾤὬΙ';'ᾥὭΙ';'ᾦὮΙ';'ᾧὯΙ';'ᾨὨΙ';
	'ᾩὩΙ';'ᾪὪΙ';'ᾫὫΙ';'ᾬὬΙ';'ᾭὭΙ';'ᾮὮΙ';'ᾯὯΙ';'ᾳΑΙ';'ᾼΑΙ';'ῃΗΙ';'ῌΗΙ';'ῳΩΙ';'ῼΩΙ';'ᾲᾺΙ';'ᾴΆΙ';'ῂῊΙ';
	'ῄΉΙ';'ῲῺΙ';'ῴΏΙ';'ᾷΑ͂Ι';'ῇΗ͂Ι';'ῷΩ͂Ι';

	'ſS';'ǅǄ';'ǈǇ';'ǋǊ';'ǲǱ';
}
