local make_map = require 'parse.char.utf8.make.map'

return make_map {
	{
		'aAZ';'àÀÖ';'øØÞ';'ȿⱾⱿ';'ɖƉƊ';'ʊƱƲ';'ͻϽϿ';'έΈΊ';'αΑΡ';'σΣΫ';'ύΎΏ';'аАЯ';'ѐЀЏ';
		'բԲՖ';'ᏸᏰᏵ';'ἁἉἏ';'ἐἘἝ';'ἠἨἯ';'ἰἸἿ';'ὀὈὍ';'ὡὩὯ';'ὰᾺΆ';'ὲῈΉ';'ὶῚΊ';'ὸῸΌ';'ὺῪΎ';
		'ὼῺΏ';'ᾀᾈᾏ';'ᾐᾘᾟ';'ᾠᾨᾯ';'ᾰᾸᾹ';'ῐῘῙ';'ῠῨῩ';'ⅰⅠⅯ';'ⓐⒶⓏ';'ⰰⰀⰮ';'ⴀႠჅ';'ꭰᎠᏯ';'ａＡＺ';
		'𐐨𐐀𐐧';'𐳀𐲀𐲲';'𑣀𑢠𑢿';
		step = 1;
	};
	{
		'āĀĮ';'ĳĲĶ';'ĺĹŇ';'ŋŊŶ';'źŹŽ';'ƃƂƇ';'ơƠƤ';'ƴƳƸ';'ǎǍƎ';'ǟǞǮ';'ǹǸȲ';'ɇɆɎ';'ͱͰͶ';'ϙϘΚ';
		'ѡѠҀ';'ҋҊҾ';'ӂӁӍ';'ӑӐԱ';'ḁḀẔ';'ạẠἈ';'ὑὙὨ';'ⱨⱧⱫ';'ⲁⲀⳲ';'ꙁꙀꙬ';'ꚁꚀꜮ';'ꜳꜲꝮ';'ꝺꝹꞆ';
		'ꞑꞐꞳ';
		step = 2;
	};
	'µΜ';'ÿŸ';'ƀɃ';'ƌƋ';'ƒƑ';'ƕǶ';'ƙƘ';'ƚȽ';'ƞȠ';'ƨƧ';'ƭƬ';'ưƯ';'ƽƼ';'ƿǷ';'ǅǄ';
	'ǆǄ';'ǈǇ';'ǉǇ';'ǋǊ';'ǌǊ';'ǲǱ';'ǳǱ';'ǵǴ';'ȼȻ';'ɂɁ';'ɐⱯ';'ɑⱭ';'ɒⱰ';'ɓƁ';'ɔƆ';'əƏ';
	'ɛƐ';'ɜꞫ';'ɠƓ';'ɡꞬ';'ɣƔ';'ɥꞍ';'ɦꞪ';'ɨƗ';'ɩƖ';'ɫⱢ';'ɬꞭ';'ɯƜ';'ɱⱮ';'ɲƝ';'ɵƟ';'ɽⱤ';
	'ʀƦ';'ʃƩ';'ʇꞱ';'ʈƮ';'ʉɄ';'ʌɅ';'ʒƷ';'ʝꞲ';'ʞꞰ';'ͅΙ';'άΆ';'ςΣ';'όΌ';'ϐΒ';'ϑΘ';'ϕΦ';
	'ϖΠ';'ϗϏ';'ϱΡ';'ϲϹ';'ϳͿ';'ϵΕ';'ϸϷ';'ϻϺ';'ӏӀ';'ᵹꝽ';'ᵽⱣ';'ẛṠ';'ᾳᾼ';'ιΙ';'ῃῌ';'ῥῬ';
	'ῳῼ';'ⅎℲ';'ↄↃ';'ⱡⱠ';'ⱥȺ';'ⱦȾ';'ⱳⱲ';'ⱶⱵ';'ⴧჇ';'ⴭჍ';'ꞌꞋ';
}
