local make_map = require 'parse.char.utf8.make.map'

return make_map {
	{
		'aAZ';'àÀÖ';'øØÞ';'ȿⱾⱿ';'ɖƉƊ';'ʊƱƲ';'ͻϽϿ';'έΈΊ';'αΑΡ';'σΣΫ';'ύΎΏ';'аАЯ';'ѐЀЏ';
		'աԱՖ';'ᏸᏰᏵ';'ἀἈἏ';'ἐἘἝ';'ἠἨἯ';'ἰἸἿ';'ὀὈὍ';'ὠὨὯ';'ὰᾺΆ';'ὲῈΉ';'ὶῚΊ';'ὸῸΌ';'ὺῪΎ';
		'ὼῺΏ';'ᾀᾈᾏ';'ᾐᾘᾟ';'ᾠᾨᾯ';'ᾰᾸᾹ';'ῐῘῙ';'ῠῨῩ';'ⅰⅠⅯ';'ⓐⒶⓏ';'ⰰⰀⰮ';'ⴀႠჅ';'ꭰᎠᏯ';'ａＡＺ';
		'𐐨𐐀𐐧';'𐳀𐲀𐲲';'𑣀𑢠𑢿';
		step = 1;
	};
	{
		'āĀĮ';'ĳĲĶ';'ĺĹŇ';'ŋŊŶ';'źŹŽ';'ƃƂƇ';'ơƠƤ';'ƴƳƵ';'ǎǍƎ';'ǟǞǮ';'ǹǸȲ';'ɇɆɎ';'ͱͰͲ';'ϙϘΚ';
		'ѡѠҀ';'ҋҊҾ';'ӂӁӍ';'ӑӐԮ';'ḁḀẔ';'ạẠỾ';'ὑὙὟ';'ⱨⱧⱫ';'ⲁⲀⳢ';'ⳬⳫⳭ';'ꙁꙀꙬ';'ꚁꚀꚚ';'ꜣꜢꜮ';'ꜳꜲꝮ';'ꝺꝹꝻ';'ꝿꝾꞆ';
		'ꞑꞐꞒ','ꞗꞖꞨ';
		step = 2;
	};
	'µΜ';'ÿŸ';'ƀɃ';'ƌƋ';'ƒƑ';'ƕǶ';'ƙƘ';'ƚȽ';'ƞȠ';'ƨƧ';'ƭƬ';'ưƯ';'ƽƼ';'ƿǷ';
	'ǆǄ';'ǉǇ';'ǌǊ';'ǳǱ';'ǵǴ';'ȼȻ';'ɂɁ';'ɐⱯ';'ɑⱭ';'ɒⱰ';'ɓƁ';'ɔƆ';'əƏ';'ͷͶ';
	'ɛƐ';'ɜꞫ';'ɠƓ';'ɡꞬ';'ɣƔ';'ɥꞍ';'ɦꞪ';'ɨƗ';'ɩƖ';'ɫⱢ';'ɬꞭ';'ɯƜ';'ɱⱮ';'ɲƝ';'ɵƟ';'ɽⱤ';
	'ʀƦ';'ʃƩ';'ʇꞱ';'ʈƮ';'ʉɄ';'ʌɅ';'ʒƷ';'ƹƸ';'ʝꞲ';'ʞꞰ';'ͅΙ';'άΆ';'ςΣ';'όΌ';'ϐΒ';'ϑΘ';'ϕΦ';
	'ϖΠ';'ϗϏ';'ϱΡ';'ϲϹ';'ϳͿ';'ϵΕ';'ϸϷ';'ϻϺ';'ӏӀ';'ᵹꝽ';'ᵽⱣ';'ẛṠ';'ᾳᾼ';'ιΙ';'ῃῌ';'ῥῬ';
	'ῳῼ';'ⅎℲ';'ↄↃ';'ⱡⱠ';'ⱥȺ';'ⱦȾ';'ⱳⱲ';'ⱶⱵ';'ⴧჇ';'ⴭჍ';'ꞌꞋ';
}
